

"""

        ##################################
        #                                #   
        #                                #   
        #                   F            #   
        #                                #   
        #      &                         #   
        #      *                         #
        #      ******                    #   
        #                                #   
        #                                #   
        #                                #   
        #        F                       #   
        #                                #   
        ##################################

"""

# matrix

"""

    [
                #col 
        #row    0  1  2
            0   [1,2,3],
            1   [4,5,6],
            2   [7,8,9],
    ]

"""

# field = [
#     [1,2,3],
#     [4,5,6],
#     [7,8,9]
# ]

# %

# 5 % 3 -> 5 - 3 = 2
# 15 % 4 -> 15 - 12 = 3
# 10 % 5 -> 10 - 10  = 0
# 3 % 3 = 0
# 4 % 3 = 1
# 5 % 3 = 2
# 6 % 3 = 0

# field = []

# row = []
# for number in range(1, 9 +1):
#     row.append(number)
#     if number % 3 == 0:
#         field.append(row)
#         row = []

# for row in field:
#     for col in row:
#         print(col, end=" ")
#     print() 

#print(field[1][0])

#field = ['#','.','&','.','.','.','.','#']


"""
    1 - Сгенерировать матрицу 10 на 10 и заполнить ее "."
    2 - Реализовать алгоритм вывода матрицы в консоль
    Доп задание
    Создать функцию для генерации матрицы 
    Создать функцию для отобраэения матрицы
"""

# field = [
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']

# ]
# Генерация матрицы


"""

    * *
    * *
    * *
    * *

"""

import time
import os

def generate_field(size_r,size_c):
    field = []
    row = []
    for symb in range(1, size_r * size_c + 1):
        row.append('.')
        if symb % size_c == 0:
            field.append(row)
            row = []
    return field

# Отображение матрицы
def show_field(field):
    for row in field:
        for col in row:
            print(col, end=" ")
        print()

if __name__ == "__main__":
    row = int(input("Enter the row size:"))
    col = int(input("Enter the col size:"))
    field = generate_field(row,col)
    cord_row = int(row/2)
    cord_col = int(col/2)
    while cord_col != col:
        os.system("clear")
        field[cord_row][cord_col] = "&"
        show_field(field)
        cord_col += 1 
        time.sleep(1)
# snake

# row - 6
# col - 8

"""

    DZ
    1 - Залить текущую версию на гит 
        в комите написать - начало работы над змейкой
    2 - Доработать идею что при движении вправо головы старые элементы исщезают

"""