

"""

        ##################################
        #                                #   
        #                                #   
        #                   F            #   
        #                                #   
        #      &                         #   
        #      *                         #
        #      ******                    #   
        #                                #   
        #                                #   
        #                                #   
        #        F                       #   
        #                                #   
        ##################################

"""

# matrix

"""

    [
                #col 
        #row    0  1  2
            0   [1,2,3],
            1   [4,5,6],
            2   [7,8,9],
    ]

"""

# field = [
#     [1,2,3],
#     [4,5,6],
#     [7,8,9]
# ]

# %

# 5 % 3 -> 5 - 3 = 2
# 15 % 4 -> 15 - 12 = 3
# 10 % 5 -> 10 - 10  = 0
# 3 % 3 = 0
# 4 % 3 = 1
# 5 % 3 = 2
# 6 % 3 = 0

# field = []

# row = []
# for number in range(1, 9 +1):
#     row.append(number)
#     if number % 3 == 0:
#         field.append(row)
#         row = []

# for row in field:
#     for col in row:
#         print(col, end=" ")
#     print() 

#print(field[1][0])

#field = ['#','.','&','.','.','.','.','#']


"""
    1 - Сгенерировать матрицу 10 на 10 и заполнить ее "."
    2 - Реализовать алгоритм вывода матрицы в консоль
    Доп задание
    Создать функцию для генерации матрицы 
    Создать функцию для отобраэения матрицы
"""

# field = [
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']
#     ['.','.','.','.','.','.','.','.','.','.']

# ]
# Генерация матрицы
field = []
row = []
def generate_matrix(field, row):
    for symb in range(1, 100 + 1):
        row.append('.')
        if symb % 10 == 0:
            field.append(row)
            row = []

# Отображение матрицы
def show_matrix(field, row):
    for row in field:
        for col in row:
            print(col, end=" ")
        print()

generate_matrix(field, row)
show_matrix(field, row)